# 빅데이터 분석기사 실기

## 참고
* 데이터마님: https://www.datamanim.com/dataset/03_dataq/index_big_python.html
* 케글 퇴근후딴짓님: https://www.kaggle.com/datasets/agileteam/bigdatacertificationkr

## 작업형 1유형

In [1]:
# 라이브러리 불러오기
import pandas as pd
import numpy as np

In [2]:
# 21. basic1 데이터 중 'age'컬럼 이상치를 제거하고, 동일한 개수로 나이 순으로 3그룹으로 나눈 뒤 각 그룹의 중앙값을 더하시오
# (이상치는 음수(0포함), 소수점 값

In [3]:
# 데이터 불러오기
csvFile = 'C:/Users/chunc/Desktop/빅분기 연습/basic1.csv'
df = pd.read_csv(csvFile)
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [4]:
# age 이상치 (음수(0포함), 소수점 제거)
print('전체 데이터:', df.shape)
df = df[~(df['age'] <= 0)]
print('음수(0포함)값 제거 후 데이터 크기:', df.shape)

df = df[(df['age'] == round(df['age'], 0))]
print('소수점 제거 후 데이터 크기:', df.shape)

전체 데이터: (100, 8)
음수(0포함)값 제거 후 데이터 크기: (96, 8)
소수점 제거 후 데이터 크기: (90, 8)

In [5]:
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [6]:
# 기준 확인, qcut 함수 활용
pd.qcut(df['age'], q = 3)

0      (0.999, 38.667]
1      (0.999, 38.667]
2      (0.999, 38.667]
3      (73.333, 100.0]
4      (0.999, 38.667]
            ...
95     (73.333, 100.0]
96     (73.333, 100.0]
97    (38.667, 73.333]
98     (0.999, 38.667]
99    (38.667, 73.333]
Name: age, Length: 90, dtype: category
Categories (3, interval[float64, right]): [(0.999, 38.667] < (38.667, 73.333] < (73.333, 100.0]]

In [7]:
# 구간 분할
df['range'] = pd.qcut(df['age'], q = 3, labels = ['group1', 'group2', 'group3'])

In [8]:
# 수량 비교
df['range'].value_counts()

range
group1    30
group2    30
group3    30
Name: count, dtype: int64

In [9]:
# 21번 정답 - 각 그룹의 중앙갑을 더하기
g1_med = df[df['range'] == 'group1']['age'].median()
g2_med = df[df['range'] == 'group2']['age'].median()
g3_med = df[df['range'] == 'group3']['age'].median()

print(g1_med + g2_med + g3_med)

165.0

In [10]:
# 22. 주어진 데이터(basic2.csv)에서 주 단위 Sales의 합계를 구하고,
# 가장 큰 값을 가진 주와 작은 값을 가진 주의 차이를 구하시오(절대값)

In [11]:
# 데이터 불러오기
# parse_dates=['Date']옵션으로 데이터타입을 바로 변환(아래 절차를 한줄로 표현한 것)
# df['Date'] = pd.to_datetime(df['Date'])
# df = df.set_index('Date')
csvFile = 'C:/Users/chunc/Desktop/빅분기 연습/basic2.csv'
df = pd.read_csv(csvFile, parse_dates = ['Date'], index_col = 0)
print(df.shape)
df.head(3)

(730, 4)

               Sales      PV      UV  Events
Date
2022-01-01  22711525  397349  4421.0       1
2022-01-02     36779    3969  2289.0       0
2022-01-03  13943875  373890     NaN       1

In [12]:
df.tail(3)

              Sales     PV      UV  Events
Date
2023-12-29  1164008  14309   193.0       0
2023-12-30  3977696  60935     NaN       0
2023-12-31  3719764  60963  1507.0       0

In [13]:
# 단위
# 주 단위: W
# 2주 단위: 2W
# 월 단위: M

# 주 단위 합계
df_w = df.resample('W').sum()
df_w.head()

               Sales       PV       UV  Events
Date
2022-01-02  22748304   401318   6710.0       1
2022-01-09  33373822  1148464  15189.0       2
2022-01-16  20754519   283773   9344.0       0
2022-01-23  21880751   538633   9841.0       1
2022-01-30  28878452   560814   7808.0       1

In [14]:
# 주 단위 Sales의  최대값
ma = df_w['Sales'].max()
ma

99165648

In [15]:
mi = df_w['Sales'].min()
mi

7526598

In [16]:
# 22정답 - 최댓값과 최솟값의 차이
print(ma - mi)

91639050

In [17]:
# 23. f1의 결측치를 채운 후 age 컬럼의 중복 제거 전과 후의 'f1' 중앙값 차이를 구하시오
# 결측치는 f1의 데이터 중 10번째로 큰 값으로 채움
# 중복 데이터 발생시 뒤에 나오는 데이터를 삭제함
# 최종 결과값은 절대값으로 출력

In [18]:
# 데이터 불러오기
csvFile = 'C:/Users/chunc/Desktop/빅분기 연습/basic1.csv'
df = pd.read_csv(csvFile)
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [19]:
# 결측치는 f1의 데이터 중 10번째로 큰 값으로 채움
top10 = df['f1'].sort_values(ascending = False).iloc[9]
print(top10)
df['f1'] = df['f1'].fillna(top10)

88.0

In [20]:
# 중복 제거 전 중앙값과 데이터 크기
result1 = df['f1'].median()
print(result1)
print(df.shape)
# 중복 제거 후 데이터 크기
df = df.drop_duplicates(subset = ['age'])
print(df.shape)

77.5
(100, 8)
(71, 8)

In [21]:
# 중복 제거 후 중앙값
result2 = df['f1'].median()
result2

77.0

In [22]:
# 23정답 - 중복 제거 전과 후의 중앙값 차이
print(abs(result1 - result2))

0.5

In [23]:
# 24. 주어진 데이터(basic2.csv)에서 "pv"컬럼으로 1일 시차(lag)가 있는 새로운 컬럼을 만들고
# (예: 1월 2일에는 1월 1일 pv데이터를 넣고, 1월 3일에는 1월 2일 pv데이터를 넣음),
# 새로운 컬럼의 1월 1일은 다음날(1월 2일)데이터로 결측치를 채운 다음, 
# Events가 1이면서 Sales가 1000000이하인 조건에 맞는 새로운 컬럼 합을 구하시오

In [24]:
# 데이터 불러오기
csvFile = 'C:/Users/chunc/Desktop/빅분기 연습/basic2.csv'
df = pd.read_csv(csvFile)
df.head()

         Date     Sales      PV      UV  Events
0  2022-01-01  22711525  397349  4421.0       1
1  2022-01-02     36779    3969  2289.0       0
2  2022-01-03  13943875  373890     NaN       1
3  2022-01-04   8088593  142054  2157.0       0
4  2022-01-05   2395374  190684     NaN       0

In [25]:
# 결측치 확인
df.isnull().sum()

Date       0
Sales      0
PV         0
UV        46
Events     0
dtype: int64

In [26]:
# 1일 차이가 나는 시차 만들기(shift옵션 사용)
df['previous_PV'] = df['PV'].shift(1)
df.head()

         Date     Sales      PV      UV  Events  previous_PV
0  2022-01-01  22711525  397349  4421.0       1          NaN
1  2022-01-02     36779    3969  2289.0       0     397349.0
2  2022-01-03  13943875  373890     NaN       1       3969.0
3  2022-01-04   8088593  142054  2157.0       0     373890.0
4  2022-01-05   2395374  190684     NaN       0     142054.0

In [27]:
# 1일 씩 미웠으나 가장 앞이 결측값이 된다
# 이를 바로 뒤의 값으로 채워준다
df['previous_PV'] = df['previous_PV'].fillna(method = 'bfill')
df.head()

         Date     Sales      PV      UV  Events  previous_PV
0  2022-01-01  22711525  397349  4421.0       1     397349.0
1  2022-01-02     36779    3969  2289.0       0     397349.0
2  2022-01-03  13943875  373890     NaN       1       3969.0
3  2022-01-04   8088593  142054  2157.0       0     373890.0
4  2022-01-05   2395374  190684     NaN       0     142054.0

In [28]:
# 24정답 - 조건에 맞는 새로운 컬럼 합
cond = (df['Events'] == 1) & (df['Sales'] <= 1000000)
print(df[cond]['previous_PV'].sum())

1894876.0

In [29]:
# 25. basic1 데이터에서 f4가 E로 시작하면서 부산에 살고 20대인 사람은 몇 명일까요?

In [30]:
# 데이터 불러오기
csvFile = 'C:/Users/chunc/Desktop/빅분기 연습/basic1.csv'
df = pd.read_csv(csvFile)
df.head()

     id   age city    f1  f2   f3    f4         f5
0  id01   2.0   서울   NaN   0  NaN  ENFJ  91.297791
1  id02   9.0   서울  70.0   1  NaN  ENFJ  60.339826
2  id03  27.0   서울  61.0   1  NaN  ISTJ  17.252986
3  id04  75.0   서울   NaN   2  NaN  INFP  52.667078
4  id05  24.0   서울  85.0   2  NaN  ISFJ  29.269869

In [31]:
# f4가 E로 시작하는 컬럼 새로 생성
df['EI'] = df['f4'].str[:1]

In [32]:
# 조건에 해당하는 값 저장
cond1 = df['EI'] == 'E'
cond2 = df['city'] == '부산'
cond3 = (df['age'] >= 20) & (df['age'] < 30)

In [33]:
# 25정답 - 조건을 합친 사람의 수 구하기
print(len(df[cond1 & cond2 & cond3]))

0

In [34]:
# 26. menu컬럼에 "라떼" 키워드가 있는 데이터의 수는?

In [35]:
# 데이터 불러오기
csvFile = 'C:/Users/chunc/Desktop/빅분기 연습/payment.csv'
df = pd.read_csv(csvFile)
df.head()

       date  hour   menu  price
0  20221129    13   딸기라떼   4000
1  20221130    12   카페라떼   3000
2  20221201    14  바닐라라떼   3500
3  20221201    16   초코라떼   3500
4  20221202    17   모카라떼   3500

In [36]:
# 26정답 - 키워드가 있는 데이터의 수
print(sum(df['menu'].str.contains('라떼')))

10

In [37]:
# 27. 바닐라라떼 5점, 카페라떼 3점, 아메리카노 2점, 나머지 0점이다 총 메뉴의 점수를 더한 값은?

In [38]:
# 데이터 불러오기
csvFile = 'C:/Users/chunc/Desktop/빅분기 연습/payment.csv'
df = pd.read_csv(csvFile)
df.head()

       date  hour   menu  price
0  20221129    13   딸기라떼   4000
1  20221130    12   카페라떼   3000
2  20221201    14  바닐라라떼   3500
3  20221201    16   초코라떼   3500
4  20221202    17   모카라떼   3500

In [39]:
# 조건 설정
df['menu'] = df['menu'].str.replace(' ', '')
s1 = sum(df['menu'].str.contains('바닐라라떼'))
s2 = sum(df['menu'].str.contains('카페라떼'))
s3 = sum(df['menu'].str.contains('아메리카노'))

In [40]:
# 27정답 - 가중치를 설정하여 메뉴의 점수 합계 구하기
print((s1*5) + (s2*3) + (s3*2))

17

In [41]:
# 28. 시간(hour)이 13시 이전(13시 포함하지 않음)
# 데이터 중 가장 많은 결제가 이루어진 날짜(date)는? (date 컬럼과 동일한 양식으로 출력)

In [42]:
# 데이터 불러오기
csvFile = 'C:/Users/chunc/Desktop/빅분기 연습/payment.csv'
df = pd.read_csv(csvFile)
df.head()

       date  hour   menu  price
0  20221129    13   딸기라떼   4000
1  20221130    12   카페라떼   3000
2  20221201    14  바닐라라떼   3500
3  20221201    16   초코라떼   3500
4  20221202    17   모카라떼   3500

In [43]:
# 28정답
print(df[df['hour'] < 13]['date'].value_counts().index[0])

20221203

In [44]:
# 29. 12월인 데이터 수는?

In [45]:
# 데이터 불러오기
csvFile = 'C:/Users/chunc/Desktop/빅분기 연습/payment.csv'
df = pd.read_csv(csvFile)
df.head()

       date  hour   menu  price
0  20221129    13   딸기라떼   4000
1  20221130    12   카페라떼   3000
2  20221201    14  바닐라라떼   3500
3  20221201    16   초코라떼   3500
4  20221202    17   모카라떼   3500

In [46]:
# 데이터타입 변환
df['date'] = pd.to_datetime(df['date'], format = '%Y%m%d')

In [47]:
# 29정답
print(sum(df['date'].dt.month == 12))

11